src/DataProcessors/рмкКоннектор/рмкКоннектор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рмкКоннектор</name>
</mdclass:DataProcessor>

src/Catalogs/рмкВходящиеСообщения/рмкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкВходящиеСообщения</name>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДесериализацииОбъекта</name>
    <type>
      <types>EnumRef.рмкСпособыСериализации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетодаДесериализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/рмкКоннектор/ObjectModule.bsl
Перем Компонента;

&Сервер	
Процедура Инициализировать() Экспорт
	
    ПодключениеВКУспешно = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ3_v2_1_1_149_x64", "BITERP", ТипВнешнейКомпоненты.Native);
    
    Если Не ПодключениеВКУспешно Тогда
    	ВызватьИсключение "Не удалось подключить внешнюю компоненту PinkRabbitMQ";
    КонецЕсли;	
    
    Компонента = Новый("AddIn.BITERP.PinkRabbitMQ3"); 
   	
КонецПроцедуры

Процедура Подключиться(ВиртуальныйХост) Экспорт
	
	ПараметрыВиртуальногоХоста = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(ВиртуальныйХост, "Владелец,Наименование");
	ПараметрыСервера = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(ПараметрыВиртуальногоХоста.Владелец, "Адрес,Порт,ИмяПользователя,Пароль");
	Компонента.Connect(ПараметрыСервера.Адрес, ПараметрыСервера.Порт, ПараметрыСервера.ИмяПользователя, ПараметрыСервера.Пароль, ПараметрыВиртуальногоХоста.Наименование);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение) Экспорт
	
	// отладочно
	ИмяОчереди = Сообщение.ТочкаПодключения.ИмяТочки;
	СодержимоеСообщения = Сообщение.Данные.Получить();
	
	//Попытка
	Компонента.BasicPublish("", ИмяОчереди, СодержимоеСообщения, 0, Ложь);
	//Исключение
	//КонецПопытки	
	
КонецПроцедуры	

Процедура Закрыть() Экспорт
	
	Компонента = Неопределено;
	
КонецПроцедуры	

Процедура ПолучитьСообщенияИзОчереди(СлушательОчереди) Экспорт
	
	ПрочитанноеСообщение = "";
    ТегСообщения = 0;
	
	//Попытка
		
		ИмяОчереди = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(СлушательОчереди, "ИмяОчереди");
        Потребитель = Компонента.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
        
        Пока Компонента.BasicConsumeMessage("", ПрочитанноеСообщение, ТегСообщения, 5000) Цикл
           
           	// запишем сообщение
           	ЗаписатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение);
           
            Компонента.BasicAck(ТегСообщения);
            ПрочитанноеСообщение = ""; 			// Обнуляем, чтобы избежать утечку памяти
            ТегСообщения = 0; 					// Обнуляем, чтобы избежать утечку памяти
            
        КонецЦикла;
        
        Компонента.BasicCancel("");
        
    //Исключение
     //   Сообщить(Компонента.GetLastError());
    //КонецПопытки;
	
КонецПроцедуры	

Процедура ЗаписатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение)
	
	СписокРеквизитов = "Сервер,ВиртуальныйХост,ИмяОчереди,СпособДесериализацииОбъекта,ИмяМетодаДесериализации";
	РеквизитыСлушателя = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(СлушательОчереди, СписокРеквизитов);
	
	СообщениеОбъект = Справочники.рмкВходящиеСообщения.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СообщениеОбъект, РеквизитыСлушателя);
	СообщениеОбъект.Записать();
	
КонецПроцедуры
